In [1]:
import pandas as pd
import os

In [2]:
# read all the csv files
if os.path.exists('csv_files/glassdoor_jobs_final_1.csv'):
    # run this command directly once the final csv is created
    df = pd.read_csv('csv_files/glassdoor_jobs_final_1.csv')
else:
    df_ds = pd.read_csv('csv_files/glassdoor_jobs_ds.csv')  # data scientist
    df_analyst = pd.read_csv('csv_files/glassdoor_jobs_analyst.csv') # data analyst
    df_dl = pd.read_csv('csv_files/glassdoor_jobs_DL.csv') # deep learning engineer
    df_ml = pd.read_csv('csv_files/glassdoor_jobs_ML.csv') # machine learning engineer
    df_ba = pd.read_csv('csv_files/glassdoor_jobs_BA.csv') # business analyst
    df_bde = pd.read_csv('csv_files/glassdoor_jobs_BDE.csv') # big data engineer
    df_nlp = pd.read_csv('csv_files/glassdoor_jobs_NLP.csv') # NLP engineer
    
    # join all the dataframes
    frames = [df_analyst, df_dl, df_ds, df_ml, df_bde, df_ba, df_nlp]
    df = pd.concat(frames)
    df.to_csv('csv_files/glassdoor_jobs_final.csv', index = False)

# salary parsing

The salary estimate column has the following different values:
1. per month salary
2. range of salary
3. single valued salary
4. data type is not int, so we will convert it
5. some salary range are month wise

In [3]:
def salary_parsing(salary):
    salary = salary.replace('INR ', '').replace(',','')
    if '/mo' in salary:
        salary = int(salary.split('/')[0]) * 12
        min_salary = 0
        max_salary = 0
    elif '-' in salary:
        min_salary = int(salary.split('-')[0].replace('K','')) * 1000
        max_salary = int(salary.split('-')[1].replace('K','')) * 1000
        salary = (min_salary + max_salary)/2
    else:
        salary = int(salary.replace(' ',''))
        min_salary = 0
        max_salary = 0
    if min_salary/10000 < 10:
        min_salary = min_salary *12
    if max_salary/10000 < 10:
        max_salary = max_salary *12
    if salary/10000 < 10:
        salary = salary *12
    return salary, min_salary, max_salary

In [4]:
df['avg_salary'], df['min_salary'], df['max_salary'] = zip(*df['Salary Estimate'].apply(salary_parsing))

In [5]:
df.head()

,Company Name,Competitors,Founded,Headquarters,Industry,Job Description,Job Title,Location,Rating,Revenue,Salary Estimate,Sector,Size,Type of ownership,avg_salary,min_salary,max_salary
0,Punchh\n4.2,-1,2010,-1,Enterprise Software & Network Solutions,"Punchh creates the consistent, modern experien...",Data Analyst,Jaipur,4.2,$50 to $100 million (USD),"INR 6,18,615",Information Technology,201 to 500 Employees,Company - Private,618615.0,0,0
1,"Gensuite, LLC\n3.4",-1,2008,-1,Computer Hardware & Software,Associate Data Analyst\n\nFull Time\nBangalore...,Associate Data Analyst,Bengaluru,3.4,$10 to $25 million (USD),"INR 3,18,709",Information Technology,201 to 500 Employees,Company - Private,318709.0,0,0
2,GroundTruth\n3.4,-1,2009,-1,-1,Role: Junior Data Analyst\n\nLocation: Gurgaon...,Junior Data Analyst,Gurgaon,3.4,Less than $1 million (USD),INR 783K - INR 849K,-1,201 to 500 Employees,Company - Private,816000.0,783000,849000
3,"Amazon.com, Inc.\n4.3",-1,1994,-1,Internet,Amazon Indias Supply Chain & Analytics team is...,Data Analyst Support,Bengaluru,4.3,$10+ billion (USD),"INR 14,39,361",Information Technology,10000+ Employees,Company - Public,1439361.0,0,0
4,"Amazon.com, Inc.\n4.3",-1,1994,-1,Internet,Amazon's Marketplace Trust team works to ensur...,Data Analyst,Bengaluru,4.3,$10+ billion (USD),"INR 14,39,361",Information Technology,10000+ Employees,Company - Public,1439361.0,0,0

In [6]:
print(df[['Company Name', 'avg_salary']][df['avg_salary'] == min(df['avg_salary'])])
print('\n')
print(df[['Company Name', 'avg_salary']][df['avg_salary'] == max(df['avg_salary'])])

                                Company Name  avg_salary
89   MongoDB, Inc. formerly 10gen, Inc.\n4.4    105000.0
118  MongoDB, Inc. formerly 10gen, Inc.\n4.4    105000.0
147  MongoDB, Inc. formerly 10gen, Inc.\n4.4    105000.0
535                        Aurigin Inc.\n4.9    105000.0


           Company Name  avg_salary
397  Conviva, Inc.\n4.1   6278000.0

# Company Name
1. remove the duplicate rows from the data set
2. company name has rating appended, we will split it

In [7]:
df['Company Name'].value_counts()

HP Inc.\n4.1                                 29
Netomi\n4.8                                  27
Amazon.com, Inc.\n4.3                        18
JPMorgan Chase & Co.\n3.9                    11
Amazon\n4.3                                   9
                                             ..
Scienaptic Systems\n3.7                       1
Accenture\n4.0                                1
The Straits Network Pte Ltd\n2.3              1
Fidelity Management and Research LLC\n4.0     1
Chandigarh University\n4.6                    1
Name: Company Name, Length: 320, dtype: int64

In [8]:
#drop duplicate rows from the data
df = df.drop_duplicates()

In [9]:
df['Company Name'] = df['Company Name'].astype(str)

In [10]:
# remove rating from company name
df['Company Name'] = df['Company Name'].apply(lambda x: x.split('\n')[0])

# Location column
Location India is vague but no other substitute

In [11]:
df['Location'].value_counts()

Bengaluru              188
Hyderabad               57
Chennai                 43
Pune                    42
Gurgaon                 34
Mumbai                  33
India                   15
Noida                   13
Kochi                    7
Jaipur                   7
New Delhi                7
Ahmedabad                5
Thiruvananthapuram       3
Chandigarh               3
SAS Nagar                2
Kolkata                  2
Kanpur Nagar             2
Indore                   1
Hiranandani Gardens      1
Ernakulam                1
Andheri                  1
Chhota Udaipur           1
Andhra Pradesh           1
Tamil Nadu               1
Vadodara                 1
Kharar                   1
Bagalur                  1
Coimbatore               1
Bhubaneswar              1
Name: Location, dtype: int64

# Company Age

In [12]:
df['age'] = df.Founded.apply(lambda x: x if x<1 else 2020-x)

# Job description parsing

The job description in the data is huge hence we will parse out only the important part

1.The most common tools required in data science field have the following keywords:
    Python, R, AWS, Spark, database, R studio, Tableau, Tensorflow, NLTK, Power BI, Excel, Hadoop, Azure, scikit-learn

2.It can be helpful to analyze if a bachelors degree is required

In [13]:
tools = ['python', 'sas', 'aws', 'spark', 'sql', 'tableau', 'tensorflow', 'nltk', 'power bi', 'excel', 'hadoop', 'azure', 'scikit-learn', 'NLP']
for tool in tools:
    df[tool] = df['Job Description'].apply(lambda x: 1 if tool in x.lower() else 0)
    print(tool)
    print(df[tool].value_counts())

python
1    279
0    197
Name: python, dtype: int64
sas
0    437
1     39
Name: sas, dtype: int64
aws
0    351
1    125
Name: aws, dtype: int64
spark
0    346
1    130
Name: spark, dtype: int64
sql
1    247
0    229
Name: sql, dtype: int64
tableau
0    407
1     69
Name: tableau, dtype: int64
tensorflow
0    410
1     66
Name: tensorflow, dtype: int64
nltk
0    460
1     16
Name: nltk, dtype: int64
power bi
0    452
1     24
Name: power bi, dtype: int64
excel
0    253
1    223
Name: excel, dtype: int64
hadoop
0    353
1    123
Name: hadoop, dtype: int64
azure
0    428
1     48
Name: azure, dtype: int64
scikit-learn
0    454
1     22
Name: scikit-learn, dtype: int64
NLP
0    476
Name: NLP, dtype: int64

In [14]:
df.head()

,Company Name,Competitors,Founded,Headquarters,Industry,Job Description,Job Title,Location,Rating,Revenue,...,sql,tableau,tensorflow,nltk,power bi,excel,hadoop,azure,scikit-learn,NLP
0,Punchh,-1,2010,-1,Enterprise Software & Network Solutions,"Punchh creates the consistent, modern experien...",Data Analyst,Jaipur,4.2,$50 to $100 million (USD),...,1,1,0,0,1,0,0,0,0,0
1,"Gensuite, LLC",-1,2008,-1,Computer Hardware & Software,Associate Data Analyst\n\nFull Time\nBangalore...,Associate Data Analyst,Bengaluru,3.4,$10 to $25 million (USD),...,1,1,0,0,0,1,0,0,0,0
2,GroundTruth,-1,2009,-1,-1,Role: Junior Data Analyst\n\nLocation: Gurgaon...,Junior Data Analyst,Gurgaon,3.4,Less than $1 million (USD),...,1,1,0,0,0,1,0,0,0,0
3,"Amazon.com, Inc.",-1,1994,-1,Internet,Amazon Indias Supply Chain & Analytics team is...,Data Analyst Support,Bengaluru,4.3,$10+ billion (USD),...,1,1,0,0,0,1,0,0,0,0
4,"Amazon.com, Inc.",-1,1994,-1,Internet,Amazon's Marketplace Trust team works to ensur...,Data Analyst,Bengaluru,4.3,$10+ billion (USD),...,1,1,0,0,0,1,0,0,0,0

In [15]:
# for R programming 
def r_programming(jd):
    if 'R programming' in jd or 'R language' in jd or 'R,' in jd or 'R/' in jd:
        return 1
    else:
        return 0
    
df['r_prog'] = df['Job Description'].apply(r_programming)
df['r_prog'].value_counts()

0    372
1    104
Name: r_prog, dtype: int64

In [16]:
df.columns

Index(['Company Name', 'Competitors', 'Founded', 'Headquarters', 'Industry',
       'Job Description', 'Job Title', 'Location', 'Rating', 'Revenue',
       'Salary Estimate', 'Sector', 'Size', 'Type of ownership', 'avg_salary',
       'min_salary', 'max_salary', 'age', 'python', 'sas', 'aws', 'spark',
       'sql', 'tableau', 'tensorflow', 'nltk', 'power bi', 'excel', 'hadoop',
       'azure', 'scikit-learn', 'NLP', 'r_prog'],
      dtype='object')

In [17]:
df['degree_req'] = df['Job Description'].apply(lambda x: 1 if "bachelor's degree" in x.lower() else 0)
df['degree_req'].value_counts()

0    447
1     29
Name: degree_req, dtype: int64

# Job title simplification
we basically split the job titles into different broad categories
1. Data scientist
2. Data analyst
3. Machine learning Engineer
4. Big data engineer
5. Data engineer
6. NLP engineer
7. AI engineer
8. manager
9. director
10. business analyst

In [18]:
df['Job Title'].value_counts()

Data Analyst                                                77
Data Scientist                                              48
Data Engineer                                               39
Machine Learning Engineer                                   37
Business Analyst                                            36
                                                            ..
Applied Scientist II                                         1
Technical & Business Operations Analyst                      1
EOPS Data Analyst                                            1
Associate - Business Analyst - Data Lifecycle Management     1
Machine Learning Engineer - Bangalore/Mumbai/                1
Name: Job Title, Length: 203, dtype: int64

In [19]:
def job_simplifier(job_title):
    if 'data scientist' in job_title.lower():
        return 'data scientist'
    elif 'data analyst' in job_title.lower():
        return 'data analyst'
    elif 'machine learning engineer' or 'ml engineer' or 'machine learning' in job_title.lower():
        return 'MLE'
    elif 'big data engineer' or 'big data' in job_title.lower():
        return 'BDE'
    elif 'data engineer' in job_title.lower():
        return 'data engineer'
    elif 'nlp engineer' in job_title.lower():
        return 'NLPE'
    elif 'ai engineer' in job_title.lower():
        return 'AIE'
    elif 'manager' in job_title.lower():
        return 'manager'
    elif 'director' in job_title.lower():
        return 'director'
    elif 'business analyst' in job_title.lower():
        return 'BA'
    elif 'software engineer' in job_title.lower():
        return 'software engineer'
    elif 'deep learning engineer' in job_title.lower():
        return 'DLE'
    else:
        return 'na'

In [20]:
# remove rows with blank job title
df.drop(df.index[100], inplace=True)

In [21]:
df['job_simplifier'] = df['Job Title'].apply(job_simplifier)
df['job_simplifier'].value_counts()

na                129
data analyst       97
data scientist     67
data engineer      51
BA                 49
MLE                45
BDE                26
AIE                 6
manager             5
Name: job_simplifier, dtype: int64

# Convert dataframe to csv

In [22]:
df.to_csv('csv_files/salary_data_cleaned.csv')